# DAY 6

## 과제1

In [2]:
import pandas as pd
import numpy as np

In [57]:
df = pd.DataFrame({'cust_id': ['c1', 'c1', 'c1', 'c2', 'c2', 'c2', 'c3', 'c3', 'c3'],
                   'prod_cd': ['p1', 'p2', 'p3', 'p1', 'p2', 'p3', 'p1', 'p2', 'p3'],
                   'grade': ['A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B'],
                   'pch_amt': [30, 10, 0, 40, 15, 30, 0, 0, 10]})

In [58]:
df

  cust_id prod_cd grade  pch_amt
0      c1      p1     A       30
1      c1      p2     A       10
2      c1      p3     A        0
3      c2      p1     A       40
4      c2      p2     A       15
5      c2      p3     A       30
6      c3      p1     B        0
7      c3      p2     B        0
8      c3      p3     B       10

아래와 같은 구조로 변경해보세요 (-- 1)
```python
# result_df
prod_cd  p1  p2  p3
cust_id           
c1       30  10   0
c2       40  15  30
c3        0   0  10

```

In [59]:
df.pivot(index='cust_id', columns='prod_cd', values='pch_amt')

prod_cd  p1  p2  p3
cust_id
c1       30  10   0
c2       40  15  30
c3        0   0  10

아래와 같은 구조로 변경해보세요 (-- 2)
```python
prod_cd        p1  p2  p3
cust_id grade           
c1      A      30  10   0
c2      A      40  15  30
c3      B       0   0  10
```

In [60]:
pd.pivot_table(df, index=['cust_id', 'grade'], columns='prod_cd', values='pch_amt')

prod_cd        p1  p2  p3
cust_id grade
c1      A      30  10   0
c2      A      40  15  30
c3      B       0   0  10

아래와 같은 구조로 변경해보세요 (-- 3)
```python
prod_cd    p1    p2    p3    All
grade                          
A        70.0  25.0  30.0  125.0
B         0.0   0.0  10.0   10.0
All      70.0  25.0  40.0  135.0
```

In [62]:
pd.pivot_table(df, index = 'grade', columns='prod_cd', values = 'pch_amt', 
               aggfunc = sum, margins =True)

prod_cd  p1  p2  p3  All
grade
A        70  25  30  125
B         0   0  10   10
All      70  25  40  135

## 과제 2

In [64]:
mul_index = pd.MultiIndex.from_tuples([('cust_1', '2015'), ('cust_1', '2016'),
('cust_2', '2015'), ('cust_2', '2016')])

data = pd.DataFrame(data=np.arange(16).reshape(4, 4),
                    index=mul_index,
                    columns=['prd_1', 'prd_2', 'prd_3', 'prd_4'],
                    dtype='int')
data.loc[['cust_2'], ['prd_4']] = np.nan

In [65]:
data

             prd_1  prd_2  prd_3  prd_4
cust_1 2015      0      1      2    3.0
       2016      4      5      6    7.0
cust_2 2015      8      9     10    NaN
       2016     12     13     14    NaN

In [69]:
result_df = data.stack(dropna=False)
result_df

cust_1  2015  prd_1     0.0
              prd_2     1.0
              prd_3     2.0
              prd_4     3.0
        2016  prd_1     4.0
              prd_2     5.0
              prd_3     6.0
              prd_4     7.0
cust_2  2015  prd_1     8.0
              prd_2     9.0
              prd_3    10.0
              prd_4     NaN
        2016  prd_1    12.0
              prd_2    13.0
              prd_3    14.0
              prd_4     NaN
dtype: float64

In [73]:
result_df.unstack(1)

              2015  2016
cust_1 prd_1   0.0   4.0
       prd_2   1.0   5.0
       prd_3   2.0   6.0
       prd_4   3.0   7.0
cust_2 prd_1   8.0  12.0
       prd_2   9.0  13.0
       prd_3  10.0  14.0
       prd_4   NaN   NaN

## 과제 3

In [75]:
data = pd.DataFrame({'cust_ID': ['C_001', 'C_001', 'C_002', 'C_002'],
                  'prd_CD': ['P_001', 'P_002', 'P_001', 'P_002'],
                  'pch_cnt': [1, 2, 3, 4],
                  'pch_amt': [100, 200, 300, 400]})
data

  cust_ID prd_CD  pch_cnt  pch_amt
0   C_001  P_001        1      100
1   C_001  P_002        2      200
2   C_002  P_001        3      300
3   C_002  P_002        4      400

아래와 같은 구조로 변경해주세요(-- 1)
``` python
  cust_ID  prd_CD  pch_CD      pch_value
0   C_001  P_001   pch_amt        100
1   C_001  P_002   pch_amt        200
2   C_002  P_001   pch_amt        300
3   C_002  P_002   pch_amt        400
4   C_001  P_001   pch_cnt          1
5   C_001  P_002   pch_cnt          2
6   C_002  P_001   pch_cnt          3
7   C_002  P_002   pch_cnt          4
```

In [79]:
pd.melt(data, id_vars=['cust_ID', 'prd_CD'])

  cust_ID prd_CD variable  value
0   C_001  P_001  pch_cnt      1
1   C_001  P_002  pch_cnt      2
2   C_002  P_001  pch_cnt      3
3   C_002  P_002  pch_cnt      4
4   C_001  P_001  pch_amt    100
5   C_001  P_002  pch_amt    200
6   C_002  P_001  pch_amt    300
7   C_002  P_002  pch_amt    400

## 과제 4

In [81]:
data_wide = pd.DataFrame({"C1prd1": {0: "a", 1: "b", 2: "c"},
                          "C1prd2": {0: "d", 1: "e", 2: "f"},
                          "C2prd1": {0: 2.5, 1: 1.2, 2: .7},
                          "C2prd2": {0: 3.2, 1: 1.3, 2: .1},
                          "value": dict(zip(range(3), np.random.randn(3)))})
data_wide

  C1prd1 C1prd2  C2prd1  C2prd2     value
0      a      d     2.5     3.2 -0.225143
1      b      e     1.2     1.3  1.734879
2      c      f     0.7     0.1 -0.479667

```python
아래와 같은 구조로 변경해주세요(-- 1)
                value     C1    C2
seq_no prd                 
0        prd1  1.331587   a     2.5
1        prd1  0.715279   b     1.2
2        prd1 -1.545400   c     0.7
0        prd2  1.331587   d     3.2
1        prd2  0.715279   e     1.3
2        prd2 -1.545400   f     0.1
```

In [82]:
data_wide["seq_no"] = data_wide.index
data_wide

  C1prd1 C1prd2  C2prd1  C2prd2     value  seq_no
0      a      d     2.5     3.2 -0.225143       0
1      b      e     1.2     1.3  1.734879       1
2      c      f     0.7     0.1 -0.479667       2

In [104]:
data_long = pd.wide_to_long(data_wide, stubnames=['C1', 'C2'], i='seq_no', j='prd'
                            ,suffix='\\w+')
data_long

                value C1   C2
seq_no prd
0      prd1 -0.225143  a  2.5
1      prd1  1.734879  b  1.2
2      prd1 -0.479667  c  0.7
0      prd2 -0.225143  d  3.2
1      prd2  1.734879  e  1.3
2      prd2 -0.479667  f  0.1

## 과제 5

In [106]:
data = pd.DataFrame({'id': ['id1', 'id1', 'id1', 'id2', 'id2', 'id3'],
                     'fac_1': ['a', 'a', 'a', 'b', 'b', 'b'],
                     'fac_2': ['d', 'd', 'd', 'c', 'c', 'd']})
data

    id fac_1 fac_2
0  id1     a     d
1  id1     a     d
2  id1     a     d
3  id2     b     c
4  id2     b     c
5  id3     b     d

```python
아래와 같은 구조로 변경해주세요(-- 1)
fac_2  c  d
fac_1     
a      0  3
b      2  1
```

In [108]:
pd.crosstab(data.fac_1, data.fac_2)

fac_2  c  d
fac_1
a      0  3
b      2  1

``` python
아래와 같은 구조로 변경해주세요(-- 2)
fac_1  a  b  
fac_2  d  c  d
id           
id1    3  0  0
id2    0  2  0
id3    0  0  1
```

In [109]:
pd.crosstab(data.id,[data.fac_1, data.fac_2])

fac_1  a  b
fac_2  d  c  d
id
id1    3  0  0
id2    0  2  0
id3    0  0  1

아래와 같은 구조로 변경해주세요(-- 3)
```python
fac_1  a  b    All
fac_2  d  c  d   
id               
id1    3  0  0   3
id2    0  2  0   2
id3    0  0  1   1
All    3  2  1   6
```

In [111]:
pd.crosstab(data.id,[data.fac_1, data.fac_2], margins=True)

fac_1  a  b    All
fac_2  d  c  d
id
id1    3  0  0   3
id2    0  2  0   2
id3    0  0  1   1
All    3  2  1   6